Repository: Master-MiShutka/CommunicatorConfigurator
Catalog: CommunicatorShared/Resources/Strings.*.resx
Languages: be, be_by, ru_ru

# NOT_CONNECTED_DESCRIPTION
source: No connection.
be: Niama zlučennia.
be_by: Няма злучэння.
ru_ru: Нет подключения.

# DEFAULT_READY_MESSAGE
source: Ready: waiting for connect.
be: Hatovy: čakannie zlučennia.
be_by: Гатовы: чакаю злучэння.
ru_ru: Готов: ожидание подключения.

# DEFAULT_NO_IP_ADDRESS_MESSAGE
source: Wating: enter IP address.
be: Čakannie: uviadzicie IP adras
be_by: Чаканне: увядзіце IP адрас
ru_ru: Ожидание: введите IP адрес

# CHECK_NET_LEVEL_MESSAGE
source: reading signal strength
be: čytannie ŭzroŭniu sihnalu
be_by: чытанне ўзроўню сігналу
ru_ru: чтение уровня сигнала

# IS_CANCELLING_COMMAND_HEADER
source: Stopping ...
be: Spyniennie ...
be_by: Спыненне ...
ru_ru: Остановка ...

# CONNECT_COMMAND_HEADER
source: Connect
be: Padkliučycca
be_by: Падключыцца
ru_ru: Подключиться

# DISCONNECT_COMMAND_HEADER
source: Disconnect
be: Adkliučycca
be_by: Адключыцца
ru_ru: Отключиться

# START_CHECK_DEVICES_COMMAND_HEADER
source: Start check
be: Zapuscić pravierku
be_by: Запусціць праверку
ru_ru: Запустить проверку

# STOP_CHECK_DEVICES_COMMAND_HEADER
source: Stop check
be: Spynić pravierku
be_by: Спыніць праверку
ru_ru: Остановить проверку

# NEW_DEVICE_SETTINGS_IS_SAVING
source: Saving settings ...
be: Zachavannie nalad ...
be_by: Захаванне налад ...
ru_ru: Сохранение настроек ...

# NEW_DEVICE_SETTINGS_IS_NOT_DEFINED
source: No settings!
be: Nalady nie zadadzieny!
be_by: Налады не зададзены!
ru_ru: Настройки не заданы!

source: New device settings saved.
be: Novyja naladki prylady zachavany.
be_by: Новыя наладкі прылады захаваны.
ru_ru: Новые настройки устройства сохранены.

source: Error occured. New device settings not saved.
be: Uznikla pamylka. Novyja naladki prylady nie zachavany.
be_by: Узнікла памылка. Новыя наладкі прылады не захаваны.
ru_ru: Возникла ошибка. Новые настройки устройства не сохранены.

# CANCEL_COMMAND_HEADER
source: Cancel
be: Admiena
be_by: Адмена
ru_ru: Отмена

# TRY_TO_CONNECT_IP_AND_PORT
source: Try connect to {0}:{1} ...
be: sproba padkliučennia da {0}:{1}...
be_by: спроба падключэння да {0}:{1}...
ru_ru: попытка подключения к {0}:{1}...

# CONNECT_ERROR
source: Connection error.
be: Pamylka zlučennia.
be_by: Памылка злучэння.
ru_ru: Ошибка соединения.

# OPERATION_CANCELED
source: Operation cancelled.
be: Apieracyja admieniena.
be_by: Аперацыя адменена.
ru_ru: Операция отменена.

source: Error occured.
be: Uznikla pamylka.
be_by: Узнікла памылка.
ru_ru: Возникла ошибка.

source: Operation cancelling ...
be: Admiena apieracyi ...
be_by: Адмена аперацыі
ru_ru: Отмена операции ...

# PASSED_N_SECONDS
source: {0:N0} seconds passed
be: prajšlo {0:N0} siekund
be_by: прайшло {0:N0} секунд
ru_ru: прошло {0:N0} секунд

source: Connected. Data readed.
be: Padkliučany. Dadzienyja atrymany.
be_by: Падключаны. Дадзеныя атрыманы.
ru_ru: Подключен. Данные считаны.

# SUCCESSFULLY_CONNECTED_TO
source: Successfully connected to {0}:{1}.
be: Padkliučennie da {0}:{1} ŭstanoŭliena.
be_by: Падключэнне да {0}:{1} ўстаноўлена.
ru_ru: Подключение к {0}:{1} установлено.

# STARTING_UPDATE_NET_STRENGTH
source: Starts a timer to update the signal level value.
be: Zapusk tajmiera dlia abnaŭliennia značennia ŭzroŭniu sihnalu.
be_by: Запуск таймера для абнаўлення значэння ўзроўню сігналу.
ru_ru: Запуск таймера для обновления значения уровня сигнала.

# ERROR_DATA_READING
source: Error reading data.
be: Pamylka čytannia danych.
be_by: Памылка чытання даных.
ru_ru: Ошибка чтения данных.

source: Failed to establish connection.
be: Nie ŭdalosia ŭstanavić padkliučennie.
be_by: Не ўдалося ўстанавіць падключэнне.
ru_ru: Не удалось установить подключение.

source: Start devices check.
be: Zapusk pravierki prylad.
be_by: Запуск праверкі прылад.
ru_ru: Запуск проверки устройств.

# LOADED_N_LINES
source: Loaded {0} lines.
be: Atrymana {0} prylad.
be_by: Атрымана {0} прылад.
ru_ru: Получено {0} устройств.

# SKIPPED_N_LINES
source: Skipped {0} lines.
be: Prapuščana {0} prylad.
be_by: Прапушчана {0} прылад.
ru_ru: Пропущено {0} устройств.

# FAILED_TO_ESTABLISH_CONNECTION_CANCELLED
source: Failed to establish connection. Operation cancelled.
be: Nie ŭdalosia ŭstanavić padkliučennie. Apieracyja admieniena.
be_by: Не ўдалося ўстанавіць падключэнне. Аперацыя адменена.
ru_ru: Не удалось установить подключение. Операция отменена.

# FAILED_TO_ESTABLISH_CONNECTION_TIMEOUT
source: Connection failed. Timed out.
be: Nie ŭdalosia ŭstaliavać zlučennie. Čas čakannia skončyŭsia.
be_by: Не ўдалося ўсталяваць злучэнне. Час чакання скончыўся.
ru_ru: Не удалось установить подключение. Время ожидания истекло.

# UnknownData
source: ? unknown ?
be: ? nieviadoma ?
be_by: ? невядома ?
ru_ru: ? неизвестно ?

# InvalidAnswerUnknownDevice
source: An invalid response was received from the device. This may be an unsupported device.
be: Atrymany niapraviĺny adkaz ad prylady. Mahčyma hetaja niepadtrymoŭvanaja prylada.
be_by: Атрыманы няправільны адказ ад прылады. Магчыма гэтая непадтрымоўваная прылада.
ru_ru: Получен неверный ответ от устройства. Возможно это неподдерживаемое устройство.

# DEVICES_CHECKING
source: Poll devices
be: Apytannie prylad
be_by: Апытанне прылад
ru_ru: Опрос устройств
