Repository: Master-MiShutka/CommunicatorConfigurator
Catalog: CommunicatorShared/Resources/UI_strings.*.resx
Languages: be, be_by, ru_ru

# Main_window_title
source: Communicator and controller check utility
be: Pravierka kamunikataraŭ i kantrolieraŭ
be_by: Праверка камунікатараў і кантролераў
ru_ru: Проверка коммуникаторов и контроллеров

# Main_window_description
source: This utility is designed to read and change the settings of controllers and communicators produced by the branch "PSDTU" of RUE "Grodnoenergo".
be: Heta ŭtylita pryznačana dlia čytannia i zmianiennia nastrojek kantrolieraŭ i kamunikataraŭ, što vyrabliajucca filijalam "PSDTU" RUP "Hrodnaenierha".
be_by: Гэта ўтыліта прызначана для чытання і змянення настроек кантролераў і камунікатараў, што вырабляюцца філіялам "ПСДТУ" РУП "Гроднаэнерга".
ru_ru: Данная утилита предназначена для чтения и изменения настроек контроллеров и коммуникаторов, производимых филиалом "ПСДТУ" РУП "Гродноэнерго".

# Settings_tab_header
source: Application settings
be: Nalady pragramy
be_by: Налады праграмы
ru_ru: Параметры программы

# Check_devices_tab_header
source: Checking connection with devices
be: Pravierka suviazi
be_by: Праверка сувязі
ru_ru: Проверка связи

# Copyright
source: Trus Mikhail Petrovich
be: Trus Michail Piatrovič
be_by: Трус Міхаіл Пятровіч
ru_ru: Трус Михаил Петрович

# CheckContent_short_description_header
source: Short description
be: Karotkaje apisannie
be_by: Кароткае апісанне
ru_ru: Краткое описание

# CheckContent_short_description_text
source: In this mode, you can query a list of controllers or communicators. The list can be pasted from the clipboard. The clipboard should contain a table with two columns: 'Description' and 'IP address'. A ready-made Excel table can also be used. The results can be saved in it.
be: U hetym režymie možna apytać pieralik kantrolieraŭ ci kamunikataraŭ. Pieralik možna ŭstavić z bufiera abmienu. U bufiery pavinna być tablica z dvuma slupkami: 'Apisannie' i 'Ip adras'.
be_by: У гэтым рэжыме можна апытаць пералік кантролераў ці камунікатараў. Пералік можна ўставіць з буфера абмену. У буферы павінна быць табліца з двума слупкамі: 'Апісанне' і 'Ip адрас'. Таксама можа выкарыстоўвацца гатовая табліца Excel. Вынікі могуць быць захаваны ў яе.
ru_ru: В этом режиме можно опросить перечень контроллеров или коммуникаторов. Перечень можно вставить из буфера обмена. В буфере должна быть таблица с двумя столбцами: 'Описание' и 'Ip адрес'. Также может использоваться готовая таблица Excel. Результаты могут быть сохранены в неё.

# CheckContent_expander_operations_header
source: Operations
be: Apieracyi
be_by: Аперацыі
ru_ru: Операции

# CheckContent_button_clear_list
source: Clear list
be: Ačyscić spis
be_by: Ачысціць спіс
ru_ru: Очистить список

# CheckContent_button_paste_from_clipboard
source: Paste from clipboard
be: Ustavić z bufiera abmienu
be_by: Уставіць з буфера абмену
ru_ru: Вставить из буфера обмена

# CheckContent_button_copy_to_clipboard
source: Copy to clipboard
be: Skapijavać u bufier abmienu
be_by: Скапіяваць у буфер абмену
ru_ru: Скопировать в буфер обмена

# CheckContent_button_paste_from_excel
source: Paste from Excel file
be: Ustavić z fajla Excel
be_by: Уставіць з файла Excel
ru_ru: Вставить из файла Excel

# CheckContent_button_copy_to_excel
source: Write the result to an Excel file
be: Zapisać vynik u fajl Excel
be_by: Запісаць вынік у файл Excel
ru_ru: Записать результат в файл Excel

# CheckContent_button_setup_excel
source: Configure Excel file settings
be: Naladzić paramietry fajla Excel
be_by: Наладзіць параметры файла Excel
ru_ru: Настроить параметры файла Excel

# CheckContent_grid_column_description
source: Description
be: Apisannie
be_by: Апісанне
ru_ru: Описание

# CheckContent_grid_column_device_type
source: Device type
be: Typ prylady
be_by: Тып прылады
ru_ru: Тип устройства

# CheckContent_grid_column_signal_level
source: Signal level
be: Uzrovień sihnalu
be_by: Узровень сігналу
ru_ru: Уровень сигнала

# CheckContent_grid_column_net_mode
source: Network mode
be: Režym sietki
be_by: Рэжым сеткі
ru_ru: Режим сети

# CheckContent_grid_column_firmware_version
source: Firmware date
be: Data PZ
be_by: Дата ПЗ
ru_ru: Дата ПО

# CheckContent_grid_column_firmware_date
source: Firmware version
be: Viersija PZ
be_by: Версія ПЗ
ru_ru: Версия ПО

# CheckContent_grid_column_number_of_retries
source: Number of connection attempts
be: Koĺkasć sprob zlučennia
be_by: Колькасць спроб злучэння
ru_ru: Количество попыток соединения

# ConnectionParamsContent_info
source: Connection parameters
be: Paramietry zlučennia
be_by: Параметры злучэння
ru_ru: Параметры соединения

# ConnectionParamsContent_label_connection_timeout
source: Connection timeout, seconds
be: Čas čakannia zlučennia, siekund
be_by: Час чакання злучэння, секунд
ru_ru: Время ожидания соединения, секунд

# ConnectionParamsContent_label_response_timeout
source: Response waiting time, seconds
be: Čas čakannia adkazu, siekund
be_by: Час чакання адказу, секунд
ru_ru: Время ожидания ответа, секунд

# ConnectionParamsContent_label_retries
source: Attempts:
be: Sprob:
be_by: Спроб:
ru_ru: Попыток:

# ConnectionParamsContent_label_pause
source: Pause between attempts, milliseconds
be: Paŭza pamiž sprobami, milisiekund
be_by: Паўза паміж спробамі, мілісекунд
ru_ru: Пауза между попытками, миллисекунд

# ConnectionParamsContent_section_interface
source: UI interface
be: Interfiejs
be_by: Інтэрфейс
ru_ru: Интерфейс

# ConnectionParamsContent_label_use_fluent
source: Use Fluent theme
be: Vykarystoŭvać temu afarmliennia Fluent
be_by: Выкарыстоўваць тэму афармлення Fluent
ru_ru: Использовать тему оформления Fluent

# ConnectionParamsContent_label_language
source: Interface language
be: Mova interfiejsu
be_by: Мова інтэрфейсу
ru_ru: Язык интерфейса

# CurrentState_label_type
source: Type:
be: Typ:
be_by: Тып:
ru_ru: Тип:

# CurrentState_label_version
source: version:
be: viersija:
be_by: версія:
ru_ru: версия:

# CurrentState_label_from
source: from:
be: ad:
be_by: ад:
ru_ru: от:

# CurrentState_current_mode
source: Current mode
be: Biahučy režym
be_by: Бягучы рэжым
ru_ru: Текущий режим

# CurrentState_signal_level
source: signal level:
be: uzrovień sihnalu:
be_by: узровень сігналу:
ru_ru: уровень сигнала:

# CurrentState_db
source: db
be_by: дБ
ru_ru: дБ

# CurrentState_label_subnet
source: Subnet
be: Padsietka
be_by: Падсетка
ru_ru: Подсеть

# CurrentState_label_net_range
source: range:
be: dyjapazon:
be_by: дыяпазон:
ru_ru: диапазон:

# CurrentState_label_net_priority
source: priority:
be: pryjarytet:
be_by: прыярытэт:
ru_ru: приоритет:

# MainContent_device_ip_address
source: IP address:
be: IP-adras:
be_by: IP-адрас:
ru_ru: IP адрес:

# MainContent_tab_current_state
source: Status
be: Stan
be_by: Стан
ru_ru: Состояние

# MainContent_tab_network_config
source: Network settings
be: Nastrojki sietki
be_by: Настройкі сеткі
ru_ru: Настройки сети

# MainContent_tab_rs485_config
source: RS485 settings
be: Nastrojki RS485
be_by: Настройкі RS485
ru_ru: Настройки RS485

# Function_not_supported_or_no_data
source: The function is not supported by the device or an invalid response was received from the device.
be: Funkcyja prylady nie padtrymlivajecca aĺbo atrymany nikoli nie adkaz ad prylady.
be_by: Функцыя прылады не падтрымліваецца альбо атрыманы ніколі не адказ ад прылады.
ru_ru: Функция использования не приводит к получению неверного ответа от устройства.

# Write_settings
source: Save the parameters to the device
be: Zapisać paramietry ŭ pryladu
be_by: Запісаць параметры ў прыладу
ru_ru: Сохраните параметры на устройстве

# NetworkConfig_label_apn
source: Apn name
be: Nazva punktu dostupu
be_by: Назва кропкі доступу
ru_ru: Название точки доступа

# Max_field_length_16_chars
source: Maximum field length is 16 characters
be: Maksimaĺnaja daŭžynia polia – 16 simvala
be_by: Максімальная даўжыня поля – 16 сімвала
ru_ru: Максимальная длина поля – 16 символа

# Max_field_length_32_chars
source: Maximum field length is 32 characters
be: Maksimaĺnaja daŭžynia polia – 32 simvala
be_by: Максімальная даўжыня поля – 32 сімвала
ru_ru: Максимальная длина поля – 32 символа

# NetworkConfig_label_apn_user
source: Apn user name
be: Imia karystaĺnika mabiĺnaj kropki dostupu
be_by: Імя карыстальніка мабільнай кропкі доступу
ru_ru: Имя пользователя мобильной точки доступа

# NetworkConfig_label_apn_password
source: Apn password
be: Paroĺ mabiĺnaj kropki dostupu
be_by: Пароль мабільнай кропкі доступу
ru_ru: Пароль мобильной точки доступа

# NetworkConfig_label_tcp_port
source: TCP port
be_by: TCP порт
ru_ru: TCP порт

# NetworkConfig_tcp_port_tooltip
source: (used to connect to the device). The maximum value is 65535.
be: (vykarystoŭvajecca dlia padlučennia da prylady). Maksimaĺnaje značennie - 65535.
be_by: (выкарыстоўваецца для падлучэння да прылады). Максімальнае значэнне - 65535.
ru_ru: (используется для подключения к устройству). Максимальное значение – 65535.

# NetworkConfig_label_watchdog_timer
source: Watchdog timer in minutes
be: Vartavy tajmier u chvilinach
be_by: Вартавы таймер у хвілінах
ru_ru: Сторожевой таймер в минутах

# NetworkConfig_label_minutes
source: minutes
be: chvilin
be_by: хвілін
ru_ru: минут

# Rs485Config_tooltip
source: Serial Port Settings (RS485)
be: Nastrojki pasliadoŭnaha porta (RS485)
be_by: Настройкі паслядоўнага порта (RS485)
ru_ru: Настройки последовательного порта (RS485)

# Rs485Config_label_baudrate
source: Data transfer rate
be: Chutkasć pieradačy danych
be_by: Хуткасць перадачы даных
ru_ru: Скорость передачи данных

# Rs485Config_label_bits
source: Number of data bits
be: Koĺkasć bit dadzienych
be_by: Колькасць біт дадзеных
ru_ru: Количество бит данных

# Rs485Config_label_parity
source: Parity
be: Parytet
be_by: Парытэт
ru_ru: Паритет

# Rs485Config_label_stop_bits
source: Number of stop bits
be: Koĺkasć stopavych bit
be_by: Колькасць стопавых біт
ru_ru: Количество стоповых бит

# Device_tab_header
source: Device
be: Prylada
be_by: Прылада
ru_ru: Устройство

source: reading version...
be: čytannie viersii ...
be_by: чытанне версіі ...
ru_ru: чтение версии ...

# IsWritingNewDeviceConfiguration
source: writing new device configuration...
be: zapis novaj kanfihuracyi prylady ...
be_by: запіс новай канфігурацыі прылады ...
ru_ru: запись новой конфигурации устройства ...

source: reading network configuration...
be: čytannie kanfihuracyi sietki ...
be_by: чытанне канфігурацыі сеткі ...
ru_ru: чтение конфигурации сети ...

source: Checking signal level and connection type...
be: pravierka ŭzroŭniu sihnalu i typu suviazi ...
be_by: праверка ўзроўню сігналу і тыпу сувязі ...
ru_ru: проверка уровня сигнала и типа связи ...

source: reading device configuration...
be: čytannie kanfihuracyi prylady ...
be_by: чытанне канфігурацыі прылады ...
ru_ru: чтение конфигурации устройства ...

# CheckContent_grid_column_ip_address
source: IP address
be: IP-adras
be_by: IP-адрас
ru_ru: IP-адрес

# Button_ok_content
source: Ok
be: Zrazumiela
be_by: Зразумела
ru_ru: Понятно

source: Connection established.
be: Zlučennie ŭstaliavana.
be_by: Злучэнне ўсталявана.
ru_ru: Соединение установлено.

source: attempt #
be: sproba №
be_by: cпроба №
ru_ru: попытка №

source: sending data:
be: adpraŭka dadzienych:
be_by: адпраўка дадзеных:
ru_ru: отправка данных:

source: getting data:
be: atrymannie dadzienych:
be_by: атрыманне дадзеных:
ru_ru: получение данных:

# Pause
source: pause between requests
be: paŭza pamiž sprobami
be_by: паўза паміж спробамі
ru_ru: пауза между попытками

# ConnectionParamsContent_label_netStrengthCheckInterval
source: Signal level check interval, ms
be: Interval pravierki ŭzroŭniu sihnalu, ms
be_by: Інтэрвал праверкі ўзроўню сігналу, мс
ru_ru: Интервал проверки уровня сигнала, мс
